% Две стороны квадрата лежат на прямых 5x ?12y ? 65 = 0 и 5x ?12y + 26 = 0.
% Найти площадь квадрата.
clc
clf
clear

x = 0:15;
y1 = (5.*x - 65)./12;
y2 = (5.*x + 26)./12;
y3 = (-12.*x + 156)./5;
y4 = (-12.*x + 37)./5;
plot(x, y1, '.m-')
hold on
axis equal
grid on
plot(x, y2, '.g-')
plot(x, y3, '.r-')
plot(x, y4, '.b-')
legend('y1 = (5*x - 65)/12', 'y2 = (5*x + 26)/12', 'y3 = (-12*x + 156)/5', 'y4 = (-12*x + 37)/5', 2)
xlabel('x'); ylabel('y');

x = 13; y = (5*x - 65)/12; %Координаты точки A
x = 1; y = (5*x - 65)/12; %Координаты точки B
A = [13 0]
B = [1 -5]
AB = B - A

syms X
C = [X (5*X + 26)/12]
AC = C - A

Y = dot(AB, AC) %Скалярное произведение векторов
X = solve('871/6 - (169*X)/12 = 0')
C = [X (5*X + 26)/12] %Координаты точки C
AC = C - A
AC = sqrt(AC(1)^2 + AC(2)^2) %Длина вектора AC

S = AC^2

text(13, 0, 'A = (13 0)')
text(1, -5, 'B = (1 -5)')
text(134/13, 84/13, 'C = (134/13 84/13)')
% quiver(13, 0, 5, 1);
% hold on
% axis equal
% grid on
% quiver(13, 0, 1, -5);